Repository: OpenChain-Project/OpenChainChecklist
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: A happy medium is the goal.
ja: 程よい中庸こそがゴールです。

source: A quotation worth bearing in mind with regards all aspects of compliance engineering comes from C. Northcote Parkinson:
ja: コンプライアンス実行のすべての側面について心に留めておくに値するパーキンソン氏の名言があります。

source: Checklist
ja: チェックリスト

source: Checklists
ja: チェックリスト

source: Do you have FOSS training materials (e.g., slide decks or online course) covering the following topics?
ja: 以下のようなトピックをカバーしたFOSSトレーニング資料（例えば、スライドやオンラインコースなど）を用意していますか？

source: Do you have a documented policy that governs FOSS license compliance of the Supplied Software distribution (e.g., via training, internal wiki, or other practical communication method)?
ja: 供給ソフトウェアの頒布に関するFOSSライセンスコンプライアンスを統制する文書化されたポリシーを用意していますか？（例えば、トレーニング、社内Wiki、あるいは、その他の伝達手法を用いて）

source: Do you have a documented procedure that
ja: 文書化された手順によって

source: Is the policy internally communicated?
ja: そのポリシーは社内で広まっていますか？

source: Priority
ja: 優先度

source: See the ‘General Compliance Checklist’ for a short and simple checklist.
ja: ここに掲載する「総括的コンプライアンス チェックリスト」は、簡潔で簡易なチェックリストとして参照してください。

source: The FOSS policy and where to find it.
ja: FOSSポリシー、および、それがどこにあるか？

source: This is from the OpenChain Curriculum slides. It is based - in turn - on the Linux Foundation Open Compliance Program Self-Assessment Compliance Checklist. It may be suitable for a small organization or for framing the general issue for a large organization.
ja: これは、 「OpenChainカリキュラム」のスライドショーに掲載されているものですが、 Linux FoundationのOpen Compliance Program 「自己診断コンプライアンスチェックリスト」の一部を使っています。 このチェックリストは、小規模な組織で利用するのに、あるいは、大規模な組織における全般的な課題の抽出に適しています。

source: What constitutes a happy medium really depends on your organizational size.
ja: 程よい中庸として何を採るかは、組織の規模に依存します。

source: When used incorrectly they can be too general to cover the work at hand or become overwhelming task lists requiring endless review.
ja: 間違った使い方をするとチェックリストは、現場の作業をカバーするには一般的過ぎたり、あるいは、終わることのないレビューを要求するとてつもない作業リストともなりえます。

source: When used properly checklists can be a useful way to manage your GPL compliance tasks in a quick, consistent and effective manner.
ja: 正しく使えばチェックリストは、GPLコンプライアンス作業を、素早い、首尾一貫した、また効率的なやり方で管理する有用な手法となりえます。

source: You might elect to have more specific checklists to address specific compliance goals.
ja: 場合によっては、特定のコンプライアンス目標を意図して、より特定的なチェックリストを作成することを選択することもあるでしょう。

source: communicates the existence of the FOSS policy to all Software Staff?
ja: FOSSポリシーの存在がすべてのソフトウェア要員に伝わるようになっていますか？

source: “Work expands so as to fill the time available for its completion.”
ja: 「仕事というのは、その仕事の完了までに使える時間を使いきるまでいつまでも続くものです。」
